# Python and SQL Interview Basics using Google Colab

This Assignment demonstrates important Python and SQL concepts frequently asked in technical interviews.

Topics:
- Python fundamentals
- Data structures
- Functions & OOP basics
- SQL queries
- Python + SQL integration

# Python Interview Basics
## Variables & Data Types

In [1]:
a = 10          # Integer
b = 3.14        # Float
c = "Interview" # String
d = True        # Boolean

print(type(a), type(b), type(c), type(d))

<class 'int'> <class 'float'> <class 'str'> <class 'bool'>

## Lists, Tuple, Sets, Dictionary

In [3]:
# List
lst = [1,2,3,4]
lst.append(5)

# Tuple
tup = (10,20,30)

# Set
st = {1,2,2,3}
print("Set:", st)

# Dictionary
student = {"name":"Abhi", "age":21}
print(student["name"])

Set: {1, 2, 3}
Abhi

## Conditional Statements

In [4]:
num = 15

if num % 2 == 0:
    print("Even")
else:
    print("Odd")

Odd

## Loops

In [5]:
for i in range(5):
    print(i)

count = 0
while count < 3:
    print("Hello")
    count += 1

0
1
2
3
4
Hello
Hello
Hello

## Functions

In [6]:
def add(a, b):
    return a + b

print(add(5,7))

12

In [8]:
# Lambda Function
square = lambda x: x*x
print(square(6))

36

In [9]:
# List Comprehension
squares = [x*x for x in range(6)]
print(squares)

[0, 1, 4, 9, 16, 25]

## Python Interview Coding Questions

In [10]:
# Reverse a String
s = "python"
print(s[::-1])

nohtyp

In [11]:
# Check Palindrome
def palindrome(word):
    return word == word[::-1]

print(palindrome("madam"))

True

In [12]:
# Find Largest Number
numbers = [10,45,22,67,34]
print(max(numbers))

67

## SQL Queries

In [13]:
import sqlite3
#create database
conn = sqlite3.connect("interview.db")
cursor = conn.cursor()

In [14]:
# Create Table
cursor.execute("""
CREATE TABLE students(
  id INTEGER PRIMARY KEY,
  name TEXT,
  age INTEGER,
  marks INTEGER
)
""")

In [15]:
#insert data
cursor.executemany(
    "INSERT INTO students (name, age, marks) VALUES (?, ?, ?)",
    [
        ("ABHISHEKH", 21, 90),
        ("NIKHIL", 20, 90),
        ("AASHUTOSH", 21, 89),
        ("DAS", 20, 88),
    ]
)
conn.commit()

##SQL Interview Questions

In [16]:
#select all
cursor.execute("SELECT * FROM students")
print(cursor.fetchall())

#WHERE Clause
cursor.execute("SELECT * FROM students WHERE marks > 80")
print(cursor.fetchall())

#ORDER BY
cursor.execute("SELECT * FROM students ORDER BY marks DESC")
print(cursor.fetchall())

#COUNT, AVG
cursor.execute("SELECT COUNT(*), AVG(marks) FROM students")
print(cursor.fetchall())

#GROUP BY
cursor.execute("""
SELECT age, COUNT(*)
FROM students
GROUP BY age
""")

print(cursor.fetchall())

[(1, 'ABHISHEKH', 21, 90), (2, 'NIKHIL', 20, 90), (3, 'AASHUTOSH', 21, 89), (4, 'DAS', 20, 88)]
[(1, 'ABHISHEKH', 21, 90), (2, 'NIKHIL', 20, 90), (3, 'AASHUTOSH', 21, 89), (4, 'DAS', 20, 88)]
[(1, 'ABHISHEKH', 21, 90), (2, 'NIKHIL', 20, 90), (3, 'AASHUTOSH', 21, 89), (4, 'DAS', 20, 88)]
[(4, 89.25)]
[(20, 2), (21, 2)]

## Python + SQL Integration

In [17]:
#Fetch Data into Python
cursor.execute("SELECT name, marks FROM students")

for row in cursor.fetchall():
    print(f"{row[0]} scored {row[1]}")

#Update Record
cursor.execute(
    "UPDATE students SET marks = 88 WHERE name='Amit'"
)
conn.commit()

#Delete Record
cursor.execute("DELETE FROM students WHERE name='Rahul'")
conn.commit()

ABHISHEKH scored 90
NIKHIL scored 90
AASHUTOSH scored 89
DAS scored 88

## Mini Interview Project
### Student Result Management System

In [18]:
def add_student(name, age, marks):
    cursor.execute(
        "INSERT INTO students(name, age, marks) VALUES(?,?,?)",
        (name, age, marks)
    )
    conn.commit()

def show_students():
    cursor.execute("SELECT * FROM students")
    for row in cursor.fetchall():
        print(row)

add_student("Kiran", 23, 82)
show_students()

(1, 'ABHISHEKH', 21, 90)
(2, 'NIKHIL', 20, 90)
(3, 'AASHUTOSH', 21, 89)
(4, 'DAS', 20, 88)
(5, 'Kiran', 23, 82)

## Conclusion

This notebook demonstrated:
- Python fundamentals
- Problem-solving techniques
- SQL queries used in interviews
- Integration of Python with databases

These concepts form the foundation of technical interview preparation.